#+TITLE:       Algoritmo de Compressão de Huffman
#+AUTHOR:      Lucas S. Vieira
#+EMAIL:       lucasvieira@protonmail.com
#+DESCRIPTION: Implementação do método de compressão de Huffman em C++.
#+KEYWORDS:    huffman, cpp, documentação, algoritmos, estruturas de dados
#+LANGUAGE:    pt_BR
#+PROPERTY:    header-args:cpp :eval no :main no :tangle huffman.cpp
#+PROPERTY:    header-args:dot :cache yes :cmdline -Kdot -Tpng
#+STARTUP:     content


:ABNTEX2:
#+OPTIONS: toc:nil title:nil
#+LANGUAGE: pt_BR
#+BIND: org-latex-hyperref-template "\\definecolor{blue}{RGB}{41,5,195}\n\\makeatletter\n\\hypersetup{\n    pdftitle={%t},\n    pdfauthor={%a},\n    pdfkeywords={%k},\n    pdfsubject={%d},\n    pdfcreator={%c},\n    colorlinks=true,\n    linkcolor=black,\n    citecolor=black,\n    filecolor=black,\n    urlcolor=black,\n    bookmarksdepth=4\n}\n\\makeatother"

#+LATEX_CLASS: abntex2
#+LATEX_CLASS_OPTIONS: [article,12pt,openany,oneside,a4paper,chapter=TITLE,hyphen,english,brazil,chapter=TITLE,sumario=tradicional]

#+LATEX_HEADER: \usepackage{times}
#+LATEX_HEADER: \usepackage[utf8]{inputenc}
#+LATEX_HEADER: \usepackage[T1]{fontenc}
#+LATEX_HEADER: \usepackage{color}
#+LATEX_HEADER: \usepackage{microtype}
#+LATEX_HEADER: \usepackage{titlesec}
#+LATEX_HEADER: \usepackage[brazilian, hyperpageref]{backref}
#+LATEX_HEADER: \usepackage{hyperref}
#+LATEX_HEADER: \usepackage[alf,abnt-emphasize=bf,abnt-doi=link]{abntex2cite}
# #+LATEX_HEADER: \usepackage{indentfirst}
#+LATEX_HEADER: \usepackage{amssymb}
#+LATEX_HEADER: \usepackage{amsmath}
#+LATEX_HEADER: \usepackage{multicol}
#+LATEX_HEADER: \usepackage{graphicx}
#+LATEX_HEADER: \usepackage{minted}
#+LATEX_HEADER: \usepackage{indentfirst}

# Seções e subseções em Times
#+LATEX_HEADER: \titleformat{\chapter}{\normalfont\large\bfseries\uppercase}{}{0pt}{\space}
#+LATEX_HEADER: \titleformat{\section}{\normalfont\normalsize\bfseries\uppercase}{}{0pt}{\thesection\space}
*** COMMENT Dump hexadecimal do arquivo-texto

#+begin_src bash :noweb strip-export :exports results :cache yes :results verbatim :eval no
<<setpath>>
hexdump -C lipsum1.txt
#+end_src

#+RESULTS[c94ae24781614a2380f6991d4580a8349257360d]:
#+begin_example
00000000  4c 6f 72 65 6d 20 69 70  73 75 6d 20 64 6f 6c 6f  |Lorem ipsum dolo|
00000010  72 20 73 69 74 20 20 61  6d 65 74 2c 20 63 6f 6e  |r sit  amet, con|
00000020  73 65 63 74 65 74 75 72  20 61 64 69 70 69 73 63  |sectetur adipisc|
00000030  69 6e 67 20 65 6c 69 74  2e 20 50 65 6c 6c 65 6e  |ing elit. Pellen|
00000040  74 65 73 71 75 65 0a 64  69 63 74 75 6d 20 65 6e  |tesque.dictum en|
00000050  69 6d 20 61 20 6d 65 74  75 73 20 75 6c 6c 61 6d  |im a metus ullam|
00000060  63 6f 72 70 65 72 2c 20  20 61 74 20 76 65 73 74  |corper,  at vest|
00000070  69 62 75 6c 75 6d 20 6e  75 6e 63 20 73 65 6d 70  |ibulum nunc semp|
00000080  65 72 2e 20 50 68 61 73  65 6c 6c 75 73 0a 6f 72  |er. Phasellus.or|
00000090  6e 61 72 65 20 65 72 6f  73 20 20 69 6d 70 65 72  |nare eros  imper|
000000a0  64 69 65 74 20 70 75 72  75 73 20 63 75 72 73 75  |diet purus cursu|
000000b0  73 20 20 61 63 63 75 6d  73 61 6e 2e 20 4e 75 6e  |s  accumsan. Nun|
000000c0  63 20 75 72 6e 61 20 20  6e 65 71 75 65 2c 20 70  |c urna  neque, p|
000000d0  6f 72 74 61 0a 61 63 2e  0a                       |orta.ac..|
000000d9
#+end_example

